[
  {
    "companyName": "BDO",
    "companyLogo": "https://graduates24.com/images/uploads/1683526216.jpg",
    "jobType": "Vacation work",
    "location": "Port Elizabeth",
    "position": "Readiness Experience Drive (RED) Vacation Work Programme 2023",
    "description": "Our RED Programme is the ideal vacation work opportunity to gain first-hand experience of what it means to be a CA(SA) and to learn about the world of work, as well as yourself. Students from 3rd and 4th year (CTA) can apply to join the office closest to them and experience what it is like to work at BDO.\n \nThe RED Vacation work Programme is held in person, and our commitment to you and this process is unhindered. We would expect the same of you.\n \nBDO’s RED Vacation Work Programme offers:Structured, output-based environment\nGrow your knowledge and experience as a student and potential Trainee.\nOpen the door to join a dynamic and fast-growing team servicing BDO clients which are listed. \nMeet, Interact, and develop relationships with, BDO SA managers and partners Stretch yourself personally and professionally.\nRequirements:\nAny 3rd or 4th year (CTA) full-time university student who is studying:BCom in Accounting\nBCompt\nBachelor of Accountancy\nBachelor of  Business Science leading to a qualification as a CA (SA) at any southern African university accredited by SAICA\nBCom/BCompt Honours\nPGDAS/CTA",
    "applicationURL": "https://bdo.mcidirecthire.com/External/Application?Ref=TEkBhDYErs0qhHgueWeCgt/yRI+cnPLR1MRk1RR6CprFrXLdxUBmuvDnnTmdoKy7e4L8fyBYNx+DwSQWmbVwVHxUoh3sqjnHPQa8p/+a5yEU3mamZvgu9EStoh6CMwjaUsciJMrJZ6nDiSVwrVvawg==",
    "deadline": "2023-05-18T00:00:00.000Z"
  },
  {
    "companyName": "Moore",
    "jobType": "Vacation work",
    "location": "Johannesburg",
    "position": "Winter Vacation Work Experience Programme 2023",
    "description": "The Moore Johannesburg Vacation Program is open for applications for the June / July university vacation period.\n \nIf you are looking for a fast paced, energetic and entrepreneurial firm, Moore Johannesburg is exactly that.  Our program is designed around the audit experience, the culture of the firm and what a day in the life of a trainee accountant consists of.Requirements:\nThe Criteria for applications is:SA Citizen\n1st, 2nd, 3rd or honors year in BCom Accounting (SAICA / CA(SA) route only)\nExcellent track record with studies and all round individual",
    "applicationURL": "https://moore.mcidirecthire.com/Graduate/External/Application?Ref=TEkBhDYErs0qhHgueWeCgt/yRI+cnPLR1MRk1RR6CprFrXLdxUBmuvDnnTmdoKy7cQBd/ANgXerggDsw0tuzlt4FQmt9+rsyA0ZXht93ssgtBnjBMae5+eiqvxp8J/OHobAcAqpFP70RtGvwB9Knaw==",
    "deadline": "2023-05-15T00:00:00.000Z"
  },
  {
    "companyName": "Unilever",
    "companyLogo": "https://graduates24.com/images/uploads/1682234954.jpg",
    "jobType": "Vacation work",
    "location": "Nation wide",
    "position": "Internship Programme 2023",
    "description": "Unilever is pioneering an exciting and unique Africa Internship Programme. Your potential internship in Unilever is crafted to offer inexperienced graduates opportunities to work and develop in a structured way, with the goal of developing future-fit skills and experience in Unilever that prepare you for the world of work and future employment opportunities.\n The following Internship Opportunities are open for applications:\n \nSupply Chain Planning, Logistics, Procurement InternsA 3 Year University degree in any discipline with a preference for BComm Supply Chain, BBS\nOr a 4 Year BTech Degree (NQF Level 7) in any discipline with a preference for BTech Logistics, BTech Supply Chain\nHuman Resources InternsA 3 Year University degree in any discipline with preference for BCom, BBS, BPsych, BSocSci​\nOr a 4 Year BTech Degree (NQF Level 7) in any discipline with preference for BTech HR Management\nSupply Chain Engineering InternsA University Engineering degree in any discipline, with a preference for Mechanical Engineering\nOr a 4 Year BTech Engineering Degree (NQF Level 7) in any discipline with a preference for BTech in Mechanical Engineering\nMarketing InternsA 3 Year University degree in any discipline with preference for BCom, BEng and BBS degrees ​​\nOr a 4 Year BTech Degree (NQF Level 7) in any discipline with preference for BTech Marketing Management, BTech Communications, BTech Public Relations​\nFinance​​​​​​​ InternsUniversity Accounting degree in Management Accounting, Business Science, with preference for those interested in further pursuing their education towards a CA(SA) qualification.\nMust have Accounts 2 and Accounts 3 in your undergraduate degree \nInformation Technology Interns3 Year University degree in any discipline with preference for BSc Computer Science, BEng Industrial, BEng Electronic, BEng Computers or Informatics\nOr studying towrads a 4 Year BTech Degree (NQF Level 7) in any discipline with preference for BTech Information & Systems Management​\nResearch and Development​​​​​​​ Internscompleted OR studying towards a 4 Year University degree in Chemistry\ncompleted OR studying towards a BTECH in Chemistry",
    "applicationURL": "https://careers.unilever.com/job/south-africa/winter-vacation-internship-supply-chain-planning-logistics-procurement/34155/47753228512",
    "deadline": "2023-05-14T00:00:00.000Z"
  },
  {
    "companyName": "Kearney",
    "jobType": "Vacation work",
    "location": "Johannesburg",
    "position": "Winter Internship Programme 2023",
    "description": "As a global consulting partnership in more than 40 countries, our people make us who we are. We’re individuals who take as much joy from those we work with as the work itself. Driven to be the difference between a big idea and making it happen, we help our clients break through.\n \nWhat You Can ExpectIndividual and inclusive to our core. As a business analyst intern, you will receive full and ready access to our firm’s best talent to help you learn, develop and make your mark.\nPersonal and practical. You will work alongside colleagues who will help you grow as you help our clients solve their most important issues – that’s just our style.\nWe’re big enough to have it covered, small enough to really care. This holds true for both you and our clients. \nYou will be able to make an impact and develop your potential from day one within a professional environment and culture that actively fosters the following:Personal development. At Kearney, we encourage you to be yourself, and we give you the freedom to contribute creatively while you also learn, develop and make your mark. \nEntrepreneurial approach. The Kearney internship program is an outstanding introduction to the discipline of management consulting\nSupportive environment. Training is a crucial component of your introduction to the firm. As a business analyst intern, you will learn essential concepts and methodologies that are crucial to management consulting. \n We are looking for talented problem-solvers who are ready to integrate as full members of the client team. Interns are expected to contribute ideas, opinions, and new information.\n \nThe following Qualifications are preferred:A proven record of academic excellence with a bachelor's degree\nMinimum of a 65% overall average.\nNo more than 2 subjects failed through your degree.  \nSkills and Competencies:Outstanding written and verbal communication skills\nStrong critical thinking and analytical capabilities\nAn innovative and collaborative approach to problem-solving\nNatural self-direction, with the ability to operate in ambiguity and learn quickly\nEagerness to collaborate, and help others grow professionally\nProficiency in Microsoft Office\nProficiency in English language",
    "applicationURL": "https://kearney.taleo.net/careersection/083/jobdetail.ftl?job=004WL",
    "deadline": "2023-05-03T00:00:00.000Z"
  },
  {
    "companyName": "Citi",
    "companyLogo": "https://graduates24.com/images/uploads/1681973033.jpg",
    "jobType": "Vacation work",
    "location": "Johannesburg",
    "position": "Winter Vacation Internship Programme 2023",
    "description": "Our Winter Internship programme is a 3-week paid vacation internship programme commencing on the 26th June till 14th July 2023 for undergraduate university students. The three week programme offers in-office work experience in our Corporate Finance team in South Africa.\n \nYour time here will look something like this.\nThe program starts with a firm wide orientation where you’ll learn about our culture, as well as the benefits and responsibilities of being a member of Citi. You will receive real time responsibilities to give you a sense of what you would be doing on a day to day basis, as a full-time Citi employee.  With fellow interns, you will work alongside leaders within Citi.\n \nResponsibilities:Hands on work experience as a member of either the Corporate or the Investment Banking business unit\nGet a solid understanding of the broad range of financial services and products Citi provides\nLearn to build financial models and develop corporate finance solutions for our clients - we strive to create the best outcomes for our clients with financial ingenuity that simple, creative and responsible solutions\nConduct research and analyze industry trends to support our bespoke advice and superior value proposition\nParticipate in client development - Citi aims to be the best banking partner for our clients by delivering differentiated client experiences and maintaining a reputation of excellence\nRequirements:\nWe want to hear from you if...We look for highly motivated candidates with a strong work ethic, a positive and proactive mindset, and a firm desire to learn and succeed\nA keen interest in financial markets and current affairs is critical\nWe value diverse thinking and encourage students from all degree disciplines to consider our opportunities.\nAdvantageous: Studies in Finance, Accounting, Economics, Mathematics, Actuarial Science, Engineering and Information Technology subjects are beneficial but not essential\nA strong academic record at both Matric and university level is important",
    "applicationURL": "https://jobs.citi.com/job/-/-/287/47608681664?source=LinkedInJB",
    "deadline": "2023-04-30T00:00:00.000Z"
  },
  {
    "companyName": "Electrum",
    "jobType": "Vacation work",
    "location": "Cape Town",
    "position": "Winter Software Developer Internship - 2023",
    "description": "We run two four-week programmes a year in the winter (June/July) and summer (January) university holidays. It’s a paid, in-office programme that may lead to a permanent position, depending on company needs and the right fit.\n \nAs part of the team at Electrum, you get:to be involved in the full life cycle of our projects;\nprofessional training and on-the-job learning;\nmentorship from industry experts;\na workplace with an innovative office culture;\nto work on real customer problems;\naccess to extensive career growth opportunities;\nvaluable work experience in a real FinTech environment, where you get to work on real projects. \nRequirements:Computer Science, Engineering, Maths or Physics student in either their 2nd, 3rd or Honours year (preference is given to Honours and 3rd year students).\nA minimum average of 65% for all modules.\nExperience working with Java at university or from personal projects.\nUnderstanding fundamentals of object-oriented programming.\nExcellent interpersonal skills.\nHere are some of the benefits we offer:Flexible work hours.\nOnsite gym and shower facilities.\nDaily cooked lunches and a stocked kitchen for the afternoon nibbles.\nTeam socialising like hikes, getaways, and dinners.\nA generous leave policy, starting at 20 days per year.\nA recreational area with foosball, table tennis and an Oculus.\nFatsaks scattered around the office for deep thinking or meditation.",
    "applicationURL": "https://apply.workable.com/electrum/j/56600363B3/apply/",
    "deadline": "2023-04-26T00:00:00.000Z"
  },
  {
    "companyName": "Mazars",
    "jobType": "Vacation work",
    "location": "Nation wide",
    "position": "2023 Audit Vacation Programme - July",
    "description": "Choosing the right firm to cultivate your professional career is a big decision. An environment where you can thrive both professionally and as an individual, is ideally what all students are searching for. We invite you to join us offices, interact with our people and learn more about why Mazars could be the perfect match for you.\n \nLocations: Bloemfontein, Cape Town, Durban, Garden Route, Gauteng and Gqeberha. \n \nDuties and ResponsibilitiesThe programme is designed to be both fun and informative, and will include training sessions, talks by various members of our firm, a client visit and a fun day of teambuilding activities at the office.\nYou will be afforded the opportunity to engage with students from different universities, making this a great opportunity to expand on your professional network.\nRequirementsMust be enrolled for a SAICA-accredited graduate or postgraduate qualification.",
    "deadline": "2023-05-02T00:00:00.000Z"
  },
  {
    "companyName": "Allen and Overy",
    "jobType": "Vacation work",
    "location": "Johannesburg",
    "position": "Winter Vacation Work 2023",
    "description": "Our one-week Summer Vacation Scheme will offer you the opportunity to experience first-hand what it's like to work for A&O.  You will work on real deals and getting hands-on insight into the truly international nature of what we do and also get the opportunity to interview for Articles.\n \nPlease attach the following documents in your Online application:CV\nMotivational Letter\nFull Academic Record \nMatric Results \nReferences  (optional) \nApply Online for the Allen and Overy: Winter Vacation Work 2023",
    "deadline": "2023-04-21T00:00:00.000Z"
  },
  {
    "companyName": "Mr Price",
    "companyLogo": "https://graduates24.com/images/uploads/1680501620.jpg",
    "jobType": "Vacation work",
    "location": "Durban",
    "position": "Winter Vacation Workplace Experience Programme 2023",
    "description": "Workplace Experience Programme (WEP) is our annual Internship programme where we host 3rd/final year students from across South Africa to discover and explore a career in retail.\n \nThis is an opportunity to learn about our culture, the way we operate and the retail industry while following a tailored programme designed to give you on-the-job exposure to your field of study.\n \nWhen Does the Programme Start?Monday 26th June - Friday 14th July 2023 The following Internship Opportunities are open for applications:\n \nPlanner: Workplace Experience Programme\nMust be studying any one of the following qualifications (Diploma/Degree) Commerce\nBusiness Science\nAccounting\nMathematics\nStatistics\nEconomics\nFinance\nStrategic Management\nSupply Chain\nRetail\nLogistics\nBuying: Workplace Experience Programme\nMust be studying any one of the following qualifications (Diploma/Degree) Fashion Design\nClothing Management\nConsumer Science\nFashion Production\nFashion Buying\nFashion Management & Communications\nInterior Design\nTextiles\nDesign, Graphic Design , Marketing: Workplace Experience Programme\nMust be studying any one of the following qualifications (Diploma/Degree) Fashion Design\nGraphic Design \nGeneral Marketing\nGraphic Design\nVideo Technology or related",
    "applicationURL": "https://mycareer.csod.com/ux/ats/careersite/4/requisition/9917/application?c=mycareer&jobboardid=0#1",
    "deadline": "2023-04-13T00:00:00.000Z"
  },
  {
    "companyName": "Visa",
    "companyLogo": "https://graduates24.com/images/uploads/1679501314.png",
    "jobType": "Vacation work",
    "location": "Johannesburg",
    "position": "June Vacation Internship - Data Science (For Current Students) 2023",
    "description": "ResponsibilitiesBe an out-of-the-box thinker who is passionate about brainstorming innovative ways to use our unique data to answer business problems\nExtract and understand data to form an opinion on how to best help our clients and derive relevant insights\nWorking closely with teams across all regions in CEMEA to develop scalable and innovative big data and machine learning solutions\nApplying industry leading data science techniques to generate impactful insights for clients and to address real business problems\nDeveloping visualizations to conduct diagnostics and to connect ideas into well-grounded insights for scalable reporting using tools such as Tableau and PowerBI\nPerforming data analysis on large and complex dataset using tools such as Python/SQL/Spark to provide actionable recommendations \nRequirements:Degree in a quantitative field such as:\nComputer Science,\nMathematics,\nStatistics\nEconometrics\nStudents pursuing a Bachelor’s (Honors) or Masters Degree with a graduation date by end of 2023 or 2024\nBe available to pursue the internship June to September 2023 (Full-time)\nExcellent communication, story-telling and presentation skills\nSkills and Competencies:Extracting and aggregating data from large data sets using SQL/Hive or Spark\nAnalyzing large data sets using programming languages such as Python, R, SQL, SAS and/or Spark and using development environments such as Jupyter Notebooks\nGenerating and visualizing data-based insights in software such as Tableau\nCommunicating data-driven insights and conveying actionable recommendations\nManaging and organizing work in Office software such as Word, Excel, PowerPoint and/or Teams\nBuilding predictive and descriptive statistical models using machine learning tool kit, Jupyter notebooks, Python, and/or SAS\nData mining and statistical modeling (e.g., regression modeling, clustering techniques, decision trees, etc.)\nSuperior analytical and financial analysis skills\nStrong collaboration skills with a diverse peer group required",
    "applicationURL": "https://jobs.smartrecruiters.com/oneclick-ui/company/Visa/publication/b141bcd7-41b9-42c8-a4ae-640eeb38f1cf?dcr_ci=Visa",
    "deadline": "2023-04-01T00:00:00.000Z"
  },
  {
    "companyName": "Citi",
    "jobType": "Vacation work",
    "location": "Johannesburg",
    "position": "EMEA Banking Winter Vacation Internship Programme 2023",
    "description": "Whether you’ve got prior financial industry experience or not, this 3-week internship provides an opportunity to work for one of the world’s largest financial services organisations.  If your internship is successful, you could be considered for one of Citi’s full-time graduate or analyst programmes. \n \nThese uniquely designed full-time programmes place university graduates in specific functional teams within the bank. Our full-time programmes start with extensive classroom training and also the opportunity to complete globally recognised qualifications.\n \nYour time here will look something like this:                                                                                                                Hands on work experience as a member of either the Corporate or the Investment Banking business unit\nGet a solid understanding of the broad range of financial services and products Citi provides\nLearn to build financial models and develop corporate finance solutions for our clients - we strive to create the best outcomes for our clients with financial ingenuity that simple, creative and responsible solutions\nConduct research and analyze industry trends to support our bespoke advice and superior value proposition\nParticipate in client development - Citi aims to be the best banking partner for our clients by delivering differentiated client experiences and maintaining a reputation of excellence and integrity     \nWe want to hear from you if...We look for highly motivated candidates with a strong work ethic, a positive and proactive mindset, and a firm desire to learn and succeed\nA keen interest in financial markets and current affairs is critical\nWe value diverse thinking and encourage students from all degree disciplines to consider our opportunities.\nA strong academic record at both Matric and university level is important\nStudies in: Finance, Accounting, Economics, Mathematics, Actuarial Science, Engineering and Information Technology subjects are beneficial but not essential \nSkills and Competencies:Desire to develop a deep understanding of the financial markets and banking industry\nAnalytical and quantitative skills\nStrong communication, planning and organizational skills\nKnowledge of the global or domestic business landscape\nA strong desire to learn and success in team environments\nCommitment to personal growth and career development",
    "applicationURL": "https://jobs.citi.com/job/-/-/287/45567465776?source=LinkedInJB",
    "deadline": "2023-03-29T00:00:00.000Z"
  },
  {
    "companyName": "Allan Gray",
    "companyLogo": "https://graduates24.com/images/uploads/1678776507.png",
    "jobType": "Vacation work",
    "location": "Cape Town",
    "position": "Internship for final year students 2023",
    "description": "Purpose of the role: Our Client Service Centre is integral to our service offering for investors and our network of independent financial advisers. Our Investment Service Consultants are university graduates equipped with products, business and industry knowledge to support our investors and independent financial advisers effectively.\n \nShould you be selected to experience your internship in Retail Client Services, you will work alongside smart individuals on specialized projects designed to further enhance our service delivery to clients.\n \nResponsibilities:\nThe successful interns will be placed in suitable roles,  either Investment Service Consultant or Retail Operations for a 2 week internship to solve different challenges in each, with an opportunity to get exposure to the business, be mentored by others and present their results to senior management at Allan Gray.\n \nRequirements:This internship is only open to final year students currently completing an under or post graduate Commerce or Business Science degree with majors in: Finance, Economics, Investments, Engineering, Mathematics and Statistics.\nConsistently strong academic performance\nMust be eligible to work in South Africa\nSkills and Competencies:Strong client focus and interest in investments\nAn enquiring mind and problem-solving abilities\nStrong verbal and written communication skills\nAbility to work in a team of highly skilled individuals while delivering on your own personalised goals\nHighly adaptable and resilient",
    "deadline": "2023-03-22T00:00:00.000Z"
  },
  {
    "companyName": "Bank of America",
    "jobType": "Vacation work",
    "location": "Johannesburg",
    "position": "Investment Banking Winter Internship 2023",
    "description": "Our Winter Analyst programme is designed to offer you a broad and exciting experience of work within Investment Banking. During your internship, you will be gaining exposure to a variety of industry, country or product coverage teams.\n \nYour training and development are our top priorities with structured support offered on the job, networking opportunities, educational speaker events and mentorship throughout.\n \nResponsibilities:\nAs an Intern, your key tasks and responsibilities may include but are not limited to:Work on projects alongside bankers in specific industry, product and country coverage groups providing you with a unique learning opportunity\nHelp the team deliver solutions to clients leveraging full spectrum of the Bank's capabilities\nActively contribute to the preparation of client presentations and underlying financial analysis\nBuild relationships, knowledge and experience that will open doors to a wide range of future career opportunities\nThrough our unique pooling system, you will have the opportunity to work across multiple areas, giving you a broad understanding of the investment banking profession and offer you the chance to explore your best fit for a full-time placement\nRequirements:Candidates are required to be in their penultimate year of study pursuing a degree from an accredited college or university\nStrong A-level grades and on-track for a minimum 2:1 degree classification (or equivalent)\nFluency in English is essential for all our roles \nNB. For some roles within Emerging Markets (including sub-Sahara Africa, Russia and China), a knowledge of those regions is required so that support in the marketing of products, advising and coordinating the marketing effort to existing and potential investor base in the emerging markets region can be provided.\n \nSkills and Competencies:You'll need to demonstrate drive, innovation and a genuine interest in the financial markets\nTeamwork, leadership and problem-solving skills,\nAbility to work in a fast-paced environment,\nDisplaying analytical and problem-solving skills\nInfluencing decisions and outcomes through effective communication and interpersonal skills\nDemonstrating integrity and ethics by earning other's trust and respect through consistent honesty and professionalism in all interactions",
    "applicationURL": "https://bankcampuscareers.tal.net/vx/lang-en-GB/mobile-0/brand-4/xf-6d1fe0461bcb/candidate/so/pm/1/pl/1/opp/8809-Investment-Banking-Winter-2023-Internship-South-Africa/en-GB",
    "deadline": "2022-12-29T00:00:00.000Z"
  }
]
